Revit 2027 API
Opening.BoundaryRect Property
Retrieves the geometry information if the opening boundary is a rect.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<XYZ> BoundaryRect { get; }
Public ReadOnly Property BoundaryRect As IList(Of XYZ)
	Get
public:
property IList<XYZ^>^ BoundaryRect {
	IList<XYZ^>^ get ();
}
member BoundaryRect : IList<XYZ> with get
Property Value
IList<XYZ>
Remarks
If IsRectBoundary is false, this value is null.
See Also
Reference
Opening Class
Autodesk.Revit.DB Namespace